"""
    Цикл for
    for <переменная цикла> in <коллекция>:
        <операторы>
    Перебирающий цикл!
    1. Перебирает значения.
    2. Невозможно поменять значение переменной цикла и нарушить его ход.
    3. В переменную цикла заносится каждое очередное значение из коллекции,
       каждую итерацию (виток) цикла.

    Изменение поведения циклов:
    1. break    - завершает цикл
    2. continue - пропускает текущую итерацию
"""
for c in 'ABCDEFGHIJ':
    print(c)

for i in range(10):
    print(i)
